{
    "100": "Continue: El servidor ha recibido los encabezados y el cliente puede continuar enviando el cuerpo.",
    "101": "Switching Protocols: El servidor acepta cambiar el protocolo según la solicitud del cliente.",
    "102": "Processing: El servidor ha recibido la solicitud y la está procesando (WebDAV).",
    "103": "Early Hints: El servidor envía encabezados preliminares antes de la respuesta final.",
    "200": "OK: La solicitud se completó correctamente.",
    "201": "Created: El recurso fue creado exitosamente.",
    "202": "Accepted: La solicitud fue aceptada para procesamiento posterior.",
    "203": "Non-Authoritative Information: La información fue modificada por un intermediario.",
    "204": "No Content: Solicitud exitosa sin contenido en la respuesta.",
    "205": "Reset Content: El cliente debe restablecer la vista o formulario.",
    "206": "Partial Content: Respuesta parcial del recurso solicitado.",
    "207": "Multi-Status: Devuelve múltiples estados para una sola solicitud (WebDAV).",
    "208": "Already Reported: Evita reportar recursos duplicados (WebDAV).",
    "226": "IM Used: La respuesta representa el resultado de manipulaciones delta.",
    "300": "Multiple Choices: Existen múltiples opciones para el recurso solicitado.",
    "301": "Moved Permanently: El recurso fue movido permanentemente a otra URL.",
    "302": "Found: El recurso fue encontrado en una URL diferente temporalmente.",
    "303": "See Other: La respuesta se encuentra en otra URL usando GET.",
    "304": "Not Modified: El recurso no ha cambiado desde la última solicitud.",
    "305": "Use Proxy: El acceso al recurso debe hacerse mediante un proxy (obsoleto).",
    "306": "Unused: Código reservado y no utilizado.",
    "307": "Temporary Redirect: Redirección temporal manteniendo el método HTTP.",
    "308": "Permanent Redirect: Redirección permanente manteniendo el método HTTP.",
    "400": "Bad Request: La solicitud es inválida o está mal formada.",
    "401": "Unauthorized: Autenticación requerida o inválida.",
    "402": "Payment Required: Reservado para futuros sistemas de pago.",
    "403": "Forbidden: El servidor entiende la solicitud pero la rechaza.",
    "404": "Not Found: El recurso solicitado no existe.",
    "405": "Method Not Allowed: El método HTTP no está permitido para el recurso.",
    "406": "Not Acceptable: No se puede generar una respuesta aceptable.",
    "407": "Proxy Authentication Required: Autenticación requerida con el proxy.",
    "408": "Request Timeout: El servidor agotó el tiempo de espera.",
    "409": "Conflict: Conflicto con el estado actual del recurso.",
    "410": "Gone: El recurso ya no está disponible permanentemente.",
    "411": "Length Required: Falta el encabezado Content-Length.",
    "412": "Precondition Failed: Una condición previa falló.",
    "413": "Content Too Large: El cuerpo de la solicitud es demasiado grande.",
    "414": "URI Too Long: La URI solicitada es demasiado larga.",
    "415": "Unsupported Media Type: Tipo de contenido no soportado.",
    "416": "Range Not Satisfiable: El rango solicitado no es válido.",
    "417": "Expectation Failed: El servidor no puede cumplir la expectativa.",
    "418": "I'm a teapot: Código humorístico definido en una RFC.",
    "421": "Misdirected Request: La solicitud fue dirigida a un servidor incorrecto.",
    "422": "Unprocessable Entity: La solicitud es válida pero no puede procesarse.",
    "423": "Locked: El recurso está bloqueado (WebDAV).",
    "424": "Failed Dependency: Falló una dependencia de la solicitud (WebDAV).",
    "425": "Too Early: El servidor rechaza la solicitud por riesgo de repetición.",
    "426": "Upgrade Required: Se requiere cambiar a un protocolo diferente.",
    "428": "Precondition Required: Se requiere una condición previa.",
    "429": "Too Many Requests: Se excedió el límite de solicitudes.",
    "431": "Request Header Fields Too Large: Los encabezados son demasiado grandes.",
    "451": "Unavailable For Legal Reasons: Recurso no disponible por razones legales.",
    "500": "Internal Server Error: Error genérico del servidor.",
    "501": "Not Implemented: El servidor no soporta la funcionalidad requerida.",
    "502": "Bad Gateway: Respuesta inválida de un servidor upstream.",
    "503": "Service Unavailable: El servidor no está disponible temporalmente.",
    "504": "Gateway Timeout: El servidor upstream no respondió a tiempo.",
    "505": "HTTP Version Not Supported: La versión HTTP no es soportada.",
    "506": "Variant Also Negotiates: Error de negociación de contenido.",
    "507": "Insufficient Storage: Espacio insuficiente para completar la solicitud.",
    "508": "Loop Detected: Se detectó un bucle infinito al procesar la solicitud.",
    "510": "Not Extended: Se requieren extensiones adicionales.",
    "511": "Network Authentication Required: Autenticación requerida para acceder a la red."
}
